In [2]:
d={"name":"kalai","age":22,"mail":"kalai123@gmail.com"}
print(type(d))

<class 'dict'>

In [17]:
user_data={"users":[{"id":1,"name":"dine","age":18,"mail":"dine12@gmail.com"},
          {"id":2,"name":"jp","age":22,"mail":"jp123@gmail.com"}]}

In [18]:
print(type("users"))

<class 'str'>

In [19]:
import json
with open("user_data_org.json","w") as f:
    json.dump(user_data,f)

In [21]:
with open("user_data_org.json") as f1:
    json_data=json.load(f1)

In [24]:
print(json_data)

{'users': [{'id': 1, 'name': 'dine', 'age': 18, 'mail': 'dine12@gmail.com'}, {'id': 2, 'name': 'jp', 'age': 22, 'mail': 'jp123@gmail.com'}]}

In [29]:
import pandas as pd

In [30]:
json_df=pd.DataFrame(json_data)
json_df

                                               users
0  {'id': 1, 'name': 'dine', 'age': 18, 'mail': '...
1  {'id': 2, 'name': 'jp', 'age': 22, 'mail': 'jp...

In [35]:
json_df1=pd.json_normalize(json_df["users"])
json_df1

   id  name  age              mail
0   1  dine   18  dine12@gmail.com
1   2    jp   22   jp123@gmail.com

In [ ]:
json_df_org.to.pd.csv

In [46]:
pip install pymysql

Collecting pymysql
  Downloading PyMySQL-1.0.2-py3-none-any.whl (43 kB)
     |████████████████████████████████| 43 kB 1.1 MB/s eta 0:00:01
Installing collected packages: pymysql
Successfully installed pymysql-1.0.2
Note: you may need to restart the kernel to use updated packages.

In [47]:
import pymysql

In [49]:
connection=pymysql.connect(host="localhost",user="root",password="kalai278",database='')
cur=connection.cursor()

In [50]:
import pandas as pd
data={'Name': ['kalai', 'sharmi','prabha','sheebha'],
      'age': [24,19,27,22]}
df=pd.DataFrame(data)
df

      Name  age
0    kalai   24
1   sharmi   19
2   prabha   27
3  sheebha   22

In [51]:
cur.execute('drop database if exists Sample')
sql='''create database Sample'''
cur.execute(sql)
print("Database created")

Database created

In [53]:
cur.execute('use Sample')
cur.execute('drop table if exists Info')
cur.execute('create table Info(Name varchar(10), age int(10))')
connection.commit()
for i,row in df.iterrows():
    sql="insert into Sample.Info values(%s, %s)"
    cur.execute(sql, tuple(row))
    print("Record inserted")
connection.commit()

Record inserted
Record inserted
Record inserted
Record inserted